app/controllers/api/benches_controller.rb

  def index
    render json: Bench.all
---
SELECT "benches".* FROM "benches"

  def create
    bench = Bench.new(bench_params)

    if bench.save
---
INSERT INTO "benches" ("description", "lat", "lng", "seats", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["description", "Bench for Babe"], ["lat", 37.0], ["lng", -122.0], ["seats", 2], ["created_at", "2016-06-27 21:15:49.354209"], ["updated_at", "2016-06-27 21:15:49.354209"]]